<?php
$data = [
    [
        'id' => '1',
        'status' => 'reviewed',
        'reflect' => 'ในปัจจุบัน การศึกษาไม่ได้มุ่งเน้นเพียงการสอนความรู้ในตำราเท่านั้น 
        แต่ยังให้ความสำคัญกับการพัฒนาทักษะที่จำเป็นต่อการดำรงชีวิตในศตวรรษที่ 21 เช่น 
        การคิดวิเคราะห์ การทำงานร่วมกับผู้อื่น การแก้ปัญหา และการใช้เทคโนโลยีอย่างสร้างสรรค์
        ครูจึงไม่ใช่เพียงผู้ถ่ายทอดความรู้ แต่ยังเป็นผู้อำนวยความสะดวก (facilitator) ผู้สร้างแรงบันดาลใจ 
        และผู้ส่งเสริมให้นักเรียนสามารถเรียนรู้ด้วยตนเองได้อย่างต่อเนื่อง',
        'advisor' => [
            [
                'id' => '1',
                'name' => 'นายเอ บีซีดี',
                'comments' => 'ข้อสะท้อนคิดของคุณมีความเข้าใจในบทบาทใหม่ของครูและการพัฒนาทักษะในศตวรรษที่ 21 ได้ดีมาก ลองเพิ่มเติมตัวอย่างกิจกรรมหรือวิธีการที่ครูสามารถส่งเสริมให้นักเรียนเรียนรู้ด้วยตนเอง เพื่อให้ข้อคิดมีความชัดเจนและนำไปใช้ได้จริงมากขึ้น',
                'score' => '4'
            ]
        ]
            ],
    [
        'id' => '2',
        'status' => 'waiting',
        'reflect' => '',
        'advisor' => [  
          
        ]
            ],
            [
                'id' => '3',
                'status' => 'upcoming',
                'reflect' => '',
                'advisor' => [
                    [
 
                    ]
                ]
            ],
];
?>


<div class="bg-white p-4 rounded-lg shadow-md">
    <h1 class="text-2xl font-bold mx-2mt-2 text-center">ระบบสะท้อนคิด</h1>
    <div class="flex flex-col lg:flex-row gap-6 mt-4">
        <?php foreach ($data as $item): ?>
        <?= component('components/cardReflect.php', $item) ?>
        <?php endforeach; ?>   
    </div>
</div>